[
    {   
        "id": "1",
        "title": "KASA",
        "description": "Site de locations d'appartements entre particuliers permettant l'accès à la description, aux photos et particularités de chaque logement.",
        "images": [
            {
              "source": "../../assets/projets-pictures/kasa-site.jpg",
              "alt": "kasa-page-logement"
            }
          ],
        "mission": "  J’ai développé l'ensemble de l'application pour le front-end, avec React pour obtenir une Single Page Application respectant les maquettes Figma, gantissant un rendu fidèle et responsive. Tout le style a été développé en Sass mais aussi des animations CSS pour améliorer l'expérience utilisateur.",
        "link":"https://baptfr.github.io/react-kasa/"
    },

    {   
        "id": "2",
        "title": "Mon Vieux Grimoire",
        "description": "Site web de référencement de livres d'une chaine de librairies permettant aux utilisateurs d'ajouter des livres et de les évaluer",
        "images": [
            {
              "source": "../assets/mvg-site.jpg",
              "alt": "site-mon-vieu-grimoire"
            }
          ],
        "mission": "Pour le développement back-end de ce projet, en suivant une architecture MVC, j'ai créé un serveur avec Express afin de le connecter à une base de données MongoDB, créé une API RESTful, développé les modèles de données en utilisant Mongoose, implémenté des opérations CRUD et un système d'authentification sécurisé pour les utilisateurs. En respectant les pratiques du Green Code notament avec l'optimisation des images envoyées par les utilisateurs. ",
        "link":"https://github.com/BaptFr/ocr-projet-7.git"
    },
    {   
        "id": "3",
        "title": "Photographe Nina Carducci",
        "description": "Site présentant le travail d'une photogrraphe via un portfolio",
        "images": [
            {
              "source": "../assets/nina-car-site.jpg",
              "alt": "site-nina-photographe"
            }
          ],
        "mission": " Ce projet était centré sur l'optimisation SEO. J'ai donc d'abord identifié les freins à la performance et l'accessibilité à l'aide de Lighthouse et Wave. Puis, modifié le code en conséquence, optimisé le site mais aussi apporté un meilleur réferencement local pour cette photographe. L'ensemble a été retranscrit dans un rapport d'intervention incluant le rapport d'optimisation et le cahier de recette concernant les bugs corrigés.",
        "link":"https://nina-carducci.github.io/",
        "doc":"https://drive.google.com/file/d/1GqRVq3tn0XYgL5vM-IECAVX6OrY1INTQ/view?usp=sharing"
    }
    
]                  
